export const Element_Pages = 12;

export const noImage = "https://1080motion.com/wp-content/uploads/2018/06/NoImageFound.jpg.png"

export const CarInfo = [
    {
        url: 'https://www.avtovzglyad.ru/media/article/2021/04/19/VAZ_2101.jpg.740x555_q85_box-28%2C0%2C1132%2C828_crop_detail_upscale.jpg',
        name: '«Жигули» ВАЗ-2101',
        id: 1,
        title: 'Заднеприводная четырёхдверка малого класса «появилась на свет» в апреле 1970 года, а серийно выпускалась до 1988-го. Она имеет в своем «арсенале»: лаконичный дизайн (экстерьера и интерьера), простую и надежную конструкцию, а так же четырёхцилиндровые бензиновые моторы.'
    },
    {
        url: 'https://www.zr.ru/d/story/3a/915514/000-vaz-2102-_zr_01.jpg',
        name: '«Жигули» ВАЗ-2102',
        id: 2,
        title:'Грузопассажирская модель малого класса дебютировала в 1971 году, а свою серийную «карьеру» продолжала до 1986-го. Она обладает непримечательным дизайном и простой и надежной конструкцией, а оснащается бензиновыми карбюраторными двигателями.'
    },
    {
        url: 'https://autoiwc.ru/images/lada/vaz-2103.jpg',
        name: '«Жигули» ВАЗ-2103',
        id: 3,
        title:'Третья модель отличалась от первой внешним оформлением кузова, светотехникой, другой отделкой интерьера, новой передней панелью приборов с тахометром, вакуумным усилителем тормозов. Еще одно отличие — двигатель объемом 1,5 литра и мощностью 72 л. с. Первая партия машин была выпущена в конце 1972 года, а полноценное серийное производство стартовало в 1973 году.'
    },
    {
        url: 'https://s.auto.drom.ru/i24250/c/photos/fullsize/lada/2104/lada_2104_977983.jpg',
        name: '«Жигули» ВАЗ-2104',
        id: 4,
        title:'Универсал ВАЗ-2104 был запущен в серийное производство в 1984 году как замена модели 2102. За основу для создания машины был взят заднеприводный седан ВАЗ-2105, «четверка» отличалась от него задней частью кузова, складывающимся задним диваном и топливным баком увеличенного до 45 литров объема. На «четверках» также впервые в отечественном автопроме был применен «дворник» заднего с омывателем.'
    },
    {
        url: 'https://a.d-cd.net/b-AAAgOC0eA-960.jpg',
        name: '«Жигули» ВАЗ-2105',
        id: 5,
        title:'ВАЗ 2105 — заднеприводный легковой автомобиль с кузовом типа седан. Модель соответствует европейской моде на лаконичный дизайн внешнего вида.'
    },
    {
        url: 'https://wroom.ru/i/cars2/lada_2106_1.jpg',
        name: '«Жигули» ВАЗ-2106',
        id: 6,
        title:'ВАЗ 2106 - заднеприводный легковой автомобиль с кузовом типа седан. Это одна из самых популярных моделей Волжского автомобильного завода. Автомобиль начал производиться в далеком 1976 году.'
    },
    {
        url: 'https://kolesospec.ru/wp-content/uploads/2019/10/Avto.jpg',
        name: '«Жигули» ВАЗ-2107',
        id: 7,
        title:'ВАЗ 2107 - заднеприводный четырехдверный седан. Он является одной из самых продаваемых моделей бренда на российском авторынке. На сегодняшний день это авто также называют «Жигули», Lada 1500SL или Lada Riva, в простонародье – «семерка».'
    },
    {
        url: 'https://autoreview.ru/images/Article/1562/Article_156201_860_575.jpg',
        name: 'ВАЗ-2108',
        id: 8,
        title:'ВАЗ-2108 — трёхдверный переднеприводный хетчбэк. Модель ВАЗ-2108 положила начало массовому выпуску в стране переднеприводных легковых автомобилей, а всего за время производства было изготовлено около 900 тыс.'
    },
    {
        url: 'https://wroom.ru/i/cars2/lada_2109_1.jpg',
        name: 'ВАЗ-2109',
        id: 9,
        title:'ВАЗ 2109 — легковой переднеприводный автомобиль с кузовом типа хэтчбек. Автомобиль представляет собой 5-дверную модификацию 2108. В настоящее время модель собирается на Украине под маркой «Богдан». ВАЗ 2109 начали выпускать в 1987 г.'
    },
    {
        url: 'https://kolesa-uploads.ru/-/20a5deff-dbac-410d-9c0f-69925d301a88/samara0.jpg',
        name: 'ВАЗ-21099',
        id: 10,
        title:'ВАЗ 21099 — четырёхдверный переднеприводный седан. Это модифицированная версия 2109 с кузовом седан.\n' +
            'Модель 21099 серийно выпускалась на заводе АвтоВАЗ с 22 декабря 1990 года по 30 июня 2004 год.'
    },
    {
        url: 'https://auto.ironhorse.ru/wp-content/uploads/2009/02/2110.jpg',
        name: 'ВАЗ-2110',
        id: 11,
        title:'ВАЗ 2110 - переднеприводный автомобиль с кузовом седан. Его отличает более комфортабельный салон, диагностическая система, автоматический отопитель.'
    },
    {
        url: 'https://quto.ru/service-imgs/4c/bd/a5/8c/4cbda58cad8ad.jpeg',
        name: 'ВАЗ-2111',
        id: 12,
        title:'ВАЗ 2111 — первый переднеприводный универсал Волжского автомобильного завода. От других автомобилей отечественного производства его отличает повышенная комфортабельность, хорошая плавность хода и устойчивость на дороге.'
    },
    {
        url: 'https://avatars.mds.yandex.net/get-verba/216201/2a000001609a350783de0d3a8c593d7f8dd0/cattouchret',
        name: 'ВАЗ-2112',
        id: 13,
        title:'ВАЗ 2112 – пятидверный хэтчбек. Автомобиль сочетает в себе технические и дизайнерские решения 2110 и трансформируемое заднее сиденье универсала 2111, но имеет более престижную базовую комплектацию и уменьшенную до 4170 мм габаритную длину.'
    },
    {
        url: 'https://avatars.mds.yandex.net/get-verba/787013/2a000001609d1344680d5a3c57f1dc42513e/cattouch',
        name: 'ВАЗ-2113',
        id: 14,
        title:'ВАЗ 2113 - это трехдверный переднеприводный хэтчбек. Автомобиль является рестайлинговой версией 2108, также известный как Lada Samara.'
    },
    {
        url: 'https://wroom.ru/i/cars2/lada_2114_1.jpg',
        name: 'ВАЗ-2114',
        id: 15,
        title:'ВАЗ 2114 - переднеприводный пятидверный хэтчбек. Автомобиль является рестайлинговой версией 2109, также известный как Lada Samara 2.'
    },
    {
        url: 'http://avatars.mds.yandex.net/get-verba/787013/2a000001609d341aeef60be4fac88e7821f4/cattouchretcr',
        name: 'ВАЗ-2115',
        id: 16,
        title:'ВАЗ 2115— четырёхдверный переднеприводный седан. Автомобиль стал первенцем из линейки под условным названием «Самара-2». Он представляет собой рестайлинговую модель 21099.'
    }
];

export const carInfoCalculate = (array) => {
    let count = 0
    let countnum = 1
    for (let i = 0; i < array.length; i++) {
        array[i].numberPage = countnum
        count++
        if (count === Element_Pages) {
            count = 0
            countnum++
        }
    }
    return {
        'number_pages': countnum,
        'info': array
    }
}

